import skillsData from "../data";
import projectsData from "../projects-data";

export default {
  lang: "ar",
  nav: {
    home: "الصفحة الرئيسية",
    projects: "المشاريع",
    contact: "تواصل معي",
    darkMode: "الوضع الداكن",
  },
  hero: {
    greeting: "مرحبًا، أنا ",
    name: "لؤي",
    words: [
      "مطوّر واجهات أمامية",
      "مبرمج مبدع",
      "متعلم سريع",
      "مبرمج شغوف",
      "محلّل مشكلات",
      "متعلم مدى الحياة",
    ],

    getResume: "تحميل السيرة الذاتية",
    getToKnowMe: "تعرف عليّ",
    intro:
      "أنا مطور واجهات أمامية علمت نفسي بنفسي، ولدي شغف كبير بالبرمجة والإبداع. رغم أنني أبلغ من العمر 17 عامًا فقط، فقد بدأت ببناء مواقع ويب تفاعلية ومتجاوبة باستخدام HTML وCSS وJavaScript، بالإضافة إلى أدوات حديثة مثل React وTailwind CSS وSass وBootstrap.",
    mission:
      "أحول الأفكار إلى مشاريع حقيقية — سواء من خلال تصميم واجهة مستخدم سلسة، أو إضافة تأثيرات حركية، أو حل المشكلات عبر البرمجة. أنا الآن في رحلة لأصبح مطورًا متكاملًا، وأستمر في تعلم تقنيات جديدة وتطوير مهاراتي من خلال الدورات عبر الإنترنت، والوثائق الرسمية، والتطبيق العملي.",
    hobbies:
      "بعيدًا عن البرمجة، أحب تجربة التصاميم، ومساعدة الآخرين في الأمور التقنية، والمساهمة في مشاريع ويب شخصية وإبداعية.",
  },
  skills: {
    title: "المهارات",
    currentlyLearning: "أتعلم حاليًا",
    skillsData,
  },
  footer: {
    quickLinks: "روابط سريعة",
    copyright: "جميع الحقوق محفوظة",
    quote:
      "أتعلم باستمرار وأبني باستمرار — أستكشف تقنيات الويب الحديثة مشروعًا تلو الآخر.",
  },
  contact: {
    inputName: "أدخل اسمك",
    inputEmail: "أدخل بريدك الإلكتروني",
    inputMessage: "أدخل رسالتك",
    sendMessage: "إرسال الرسالة",
    respondEmail: (name) => {
      return `مرحبًا, ${name}

شكرًا لتواصلك معي عبر موقعي الإلكتروني. لقد استلمت رسالتك وسأقوم بالرد عليك في أقرب وقت ممكن.

أتطلع للتواصل معك!

مع أطيب التحيات،
لؤي الشجاع
`;
    },
    invalidName: "يجب أن يكون الاسم أكثر من 3 أحرف.",
    invalidEmail: "يرجى إدخال بريد إلكتروني صحيح.",
    invalidMessage: "يجب أن تكون الرسالة أطول من 10 أحرف.",
    title: "لقد استلمنا رسالتك",
  },
  projects: {
    view: "عرض",
    github: " الكود  ",
  },
  projectsData,
};
